Revit 2026 API

# MetallicPaintMetallicpaintFlecks Property

---

The property labeled "Flecks" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetallicpaintFlecks { get; }
```
```vb
Public Shared ReadOnly Property MetallicpaintFlecks As String
	Get
```
```cpp
public:
static property String^ MetallicpaintFlecks {
	String^ get ();
}
```
```fsharp
static member MetallicpaintFlecks : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintFlecksType".

#### Reference

MetallicPaint Class

Autodesk.Revit.DB.Visual Namespace